/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strjoin_free.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ssoraka <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/04/16 19:51:51 by ssoraka           #+#    #+#             */
/*   Updated: 2019/04/16 21:08:46 by ssoraka          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
**	функция возвращает указатель на новую строчку, созданную из посланных
**	первый аргумент - указатель на 1-ую строку
**	второй - указатель на 2-ую строку
**	третий - флаг для удаления 1-ой строки
**	четвертый - флаг для удаления 2-ой строки
*/

char	*ft_strjoin_free(char *str1, char *str2, int del1, int del2)
{
	char	*str;

	if (str1 == NULL)
	{
		del1 = 1;
		str1 = ft_strnew(0);
	}
	if (str2 == NULL)
	{
		del2 = 1;
		str2 = ft_strnew(0);
	}
	str = ft_strjoin(str1, str2);
	if (del1 > 0)
		free(str1);
	if (del2 > 0)
		free(str2);
	return (str);
}
